# Pandas Jupyter

In [1]:
import pandas as pd 
import numpy as np

In [2]:
dict1 = {
    "name" : ["faizan","ghania","sameer","khubaib","farhan"],
    "marks" : [92,93,34,24,17],
    "city" : ["Lahore","Lahore","karachi","islamabad","delhi"]
}

In [3]:
# It will create a data frame (like an excel sheet) analysis the data

df = pd.DataFrame(dict1)

In [4]:
df

      name  marks       city
0   faizan     92     Lahore
1   ghania     93     Lahore
2   sameer     34    karachi
3  khubaib     24  islamabad
4   farhan     17      delhi

In [5]:
# Index mean row like here is 0,1,2,3,4 

df.to_csv("friends.csv")

In [6]:
# Here we didn't put the index in this excel sheet

df.to_csv("friends_index_false.csv",index=False)

In [7]:
# It's shows the starting two rows

df.head(2)

     name  marks    city
0  faizan     92  Lahore
1  ghania     93  Lahore

In [8]:
# It's shows the ending two rows


df.tail(2)

      name  marks       city
3  khubaib     24  islamabad
4   farhan     17      delhi

In [9]:
# It's perform the Statical Analysis here

df.describe()

           marks
count   5.000000
mean   52.000000
std    37.463315
min    17.000000
25%    24.000000
50%    34.000000
75%    92.000000
max    93.000000

# How to read csv file

In [10]:
faizan = pd.read_csv('faizan.csv')

In [11]:
faizan

   Train No  speed       city
0      1232     34     Lahore
1      1231     40     Lahore
2     31234     13    karachi
3       123     13  islamabad
4       423     42      delhi

In [12]:
# It's access the speed column

faizan['speed']

0    34
1    40
2    13
3    13
4    42
Name: speed, dtype: int64

In [13]:
# It's access the speed column with index acess number

faizan['speed'][1]

40

In [14]:
# It give s a warrning please don't do this thing here but it still change the data

faizan['speed'][1] = 40

<ipython-input-14-c67efbad664b>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  faizan['speed'][1] = 40

In [15]:
faizan

   Train No  speed       city
0      1232     34     Lahore
1      1231     40     Lahore
2     31234     13    karachi
3       123     13  islamabad
4       423     42      delhi

In [16]:
faizan.to_csv('faizan.csv',index=False)

In [17]:
# How to change the index number to replace with

faizan.index = ['first','second','third','fourth','fifth']

In [18]:
faizan

        Train No  speed       city
first       1232     34     Lahore
second      1231     40     Lahore
third      31234     13    karachi
fourth       123     13  islamabad
fifth        423     42      delhi

**====================================================**

**For select the row we have to index**

**For select the column we have to Attribute name**

**===================================================**

# Theoretical Based

**=> Pandas is an open source data analysis library written in Python**

**=> It leverages the power and speed of numpy to make data analysis and preprocessing easy for data scientists**

**=> It provides rich and highly robust data operations**

If we use simple python like **list, Dict, tuple** and extract excel we cant handle a big data form so we need to require pandas library who store **csv file** in the base of pandas library it's automatically handel the data by itself.

# Pandas has two types

### Series
### Dataframe

**Series --** It's a one dimensional array with indexes, it stores a single column or row of data in a **Dataframe** (It's should have the same type of datatype in a one column).

**Dataframe --** It's a tabular spreadsheet like structure representing rows each of which contains one or multiple columns (it's hold the different tpe of data)

**So e.g**

A one-dimensional array(labeled) capable of holding any type of data-**Series**

A two-dimensional array(labeled) structure with columns of potentially different types of data- **DataFrame**

# let's practice with new point

In [19]:
ser = pd.Series(np.random.rand(34))

In [20]:
ser

0     0.532076
1     0.672154
2     0.099496
3     0.461153
4     0.226390
5     0.004928
6     0.363692
7     0.969484
8     0.387262
9     0.714362
10    0.428658
11    0.482208
12    0.360974
13    0.957338
14    0.899755
15    0.262159
16    0.269696
17    0.700926
18    0.095959
19    0.733327
20    0.295185
21    0.606718
22    0.947816
23    0.160188
24    0.681578
25    0.464797
26    0.270626
27    0.667539
28    0.427196
29    0.381794
30    0.611998
31    0.822185
32    0.253310
33    0.717806
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [22]:
newf = pd.DataFrame(np.random.rand(334,5),index = np.arange(334))

In [23]:
newf.head()

          0         1         2         3         4
0  0.490817  0.143020  0.347843  0.680186  0.783925
1  0.080284  0.619411  0.637637  0.481598  0.149782
2  0.288158  0.780141  0.422168  0.604559  0.323094
3  0.821595  0.835345  0.714774  0.848404  0.046831
4  0.194477  0.447926  0.067030  0.888192  0.668843

In [24]:
newf

            0         1         2         3         4
0    0.490817  0.143020  0.347843  0.680186  0.783925
1    0.080284  0.619411  0.637637  0.481598  0.149782
2    0.288158  0.780141  0.422168  0.604559  0.323094
3    0.821595  0.835345  0.714774  0.848404  0.046831
4    0.194477  0.447926  0.067030  0.888192  0.668843
..        ...       ...       ...       ...       ...
329  0.990653  0.565961  0.722428  0.009092  0.944413
330  0.969764  0.163666  0.908799  0.616855  0.244120
331  0.713657  0.123362  0.120819  0.199565  0.139388
332  0.922836  0.853739  0.845974  0.192337  0.743690
333  0.473598  0.786340  0.927190  0.829892  0.685971

[334 rows x 5 columns]

In [25]:
type(newf)

pandas.core.frame.DataFrame

In [26]:
newf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.503621    0.501583    0.517943    0.515573    0.507060
std      0.281886    0.286446    0.293332    0.287878    0.287069
min      0.002164    0.000561    0.003179    0.005991    0.000669
25%      0.270020    0.253540    0.263466    0.271271    0.248223
50%      0.539326    0.508276    0.553819    0.538581    0.524324
75%      0.723191    0.732311    0.773907    0.746558    0.759183
max      0.996549    0.997745    0.999220    0.991296    0.999934

In [27]:
newf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
newf[0][0]="faizan"

In [29]:
newf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
newf.head()

          0         1         2         3         4
0    faizan  0.143020  0.347843  0.680186  0.783925
1  0.080284  0.619411  0.637637  0.481598  0.149782
2  0.288158  0.780141  0.422168  0.604559  0.323094
3  0.821595  0.835345  0.714774  0.848404  0.046831
4  0.194477  0.447926  0.067030  0.888192  0.668843

In [31]:
newf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [32]:
newf.columns

RangeIndex(start=0, stop=5, step=1)

In [33]:
#How to convert into numpy array

newf.to_numpy()

array([['faizan', 0.14301951064950624, 0.3478429554824999,
        0.6801862794910035, 0.7839254600724553],
       [0.08028421761498328, 0.6194112253626012, 0.6376368181892256,
        0.4815980709343287, 0.14978236370056752],
       [0.2881584833142179, 0.7801414126196698, 0.422167587708846,
        0.6045586788711486, 0.3230939797748008],
       ...,
       [0.713657441081514, 0.12336206421494522, 0.12081902280406076,
        0.19956483337877762, 0.13938818582205093],
       [0.9228363403816325, 0.8537387511646133, 0.8459743140075452,
        0.19233671794597262, 0.7436897983286764],
       [0.4735984439798341, 0.7863402360346695, 0.9271897651927223,
        0.8298924041137469, 0.6859707585374365]], dtype=object)

In [34]:
newf[0][0] = 0.2323

<ipython-input-34-79db92ebd215>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newf[0][0] = 0.2323

In [35]:
newf.head()

          0         1         2         3         4
0    0.2323  0.143020  0.347843  0.680186  0.783925
1  0.080284  0.619411  0.637637  0.481598  0.149782
2  0.288158  0.780141  0.422168  0.604559  0.323094
3  0.821595  0.835345  0.714774  0.848404  0.046831
4  0.194477  0.447926  0.067030  0.888192  0.668843

In [36]:
# For Transpose the data

newf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.2323,0.080284,0.288158,0.821595,0.194477,0.73571,0.266905,0.47846,0.565582,0.543865,...,0.989249,0.289202,0.36402,0.16556,0.719793,0.990653,0.969764,0.713657,0.922836,0.473598
1,0.14302,0.619411,0.780141,0.835345,0.447926,0.265383,0.917742,0.7938,0.941969,0.378497,...,0.655892,0.0871,0.755674,0.595945,0.397436,0.565961,0.163666,0.123362,0.853739,0.78634
2,0.347843,0.637637,0.422168,0.714774,0.06703,0.856206,0.578764,0.176237,0.743523,0.640874,...,0.069464,0.229957,0.040716,0.117874,0.228917,0.722428,0.908799,0.120819,0.845974,0.92719
3,0.680186,0.481598,0.604559,0.848404,0.888192,0.431683,0.354202,0.938956,0.740558,0.809717,...,0.121985,0.699613,0.718601,0.667574,0.316802,0.009092,0.616855,0.199565,0.192337,0.829892
4,0.783925,0.149782,0.323094,0.046831,0.668843,0.976627,0.668903,0.523783,0.120546,0.401282,...,0.724585,0.337702,0.673796,0.839208,0.798943,0.944413,0.24412,0.139388,0.74369,0.685971

In [37]:
newf.head()

          0         1         2         3         4
0    0.2323  0.143020  0.347843  0.680186  0.783925
1  0.080284  0.619411  0.637637  0.481598  0.149782
2  0.288158  0.780141  0.422168  0.604559  0.323094
3  0.821595  0.835345  0.714774  0.848404  0.046831
4  0.194477  0.447926  0.067030  0.888192  0.668843

In [38]:
# It's sort into the row in decending order

newf.sort_index(axis=0,ascending = False)

            0         1         2         3         4
333  0.473598  0.786340  0.927190  0.829892  0.685971
332  0.922836  0.853739  0.845974  0.192337  0.743690
331  0.713657  0.123362  0.120819  0.199565  0.139388
330  0.969764  0.163666  0.908799  0.616855  0.244120
329  0.990653  0.565961  0.722428  0.009092  0.944413
..        ...       ...       ...       ...       ...
4    0.194477  0.447926  0.067030  0.888192  0.668843
3    0.821595  0.835345  0.714774  0.848404  0.046831
2    0.288158  0.780141  0.422168  0.604559  0.323094
1    0.080284  0.619411  0.637637  0.481598  0.149782
0      0.2323  0.143020  0.347843  0.680186  0.783925

[334 rows x 5 columns]

In [39]:
# It's sort into column in decending order

newf.sort_index(axis=1,ascending = False)

            4         3         2         1         0
0    0.783925  0.680186  0.347843  0.143020    0.2323
1    0.149782  0.481598  0.637637  0.619411  0.080284
2    0.323094  0.604559  0.422168  0.780141  0.288158
3    0.046831  0.848404  0.714774  0.835345  0.821595
4    0.668843  0.888192  0.067030  0.447926  0.194477
..        ...       ...       ...       ...       ...
329  0.944413  0.009092  0.722428  0.565961  0.990653
330  0.244120  0.616855  0.908799  0.163666  0.969764
331  0.139388  0.199565  0.120819  0.123362  0.713657
332  0.743690  0.192337  0.845974  0.853739  0.922836
333  0.685971  0.829892  0.927190  0.786340  0.473598

[334 rows x 5 columns]

In [40]:
newf.head()

          0         1         2         3         4
0    0.2323  0.143020  0.347843  0.680186  0.783925
1  0.080284  0.619411  0.637637  0.481598  0.149782
2  0.288158  0.780141  0.422168  0.604559  0.323094
3  0.821595  0.835345  0.714774  0.848404  0.046831
4  0.194477  0.447926  0.067030  0.888192  0.668843

In [41]:
newf[0]

0        0.2323
1      0.080284
2      0.288158
3      0.821595
4      0.194477
         ...
329    0.990653
330    0.969764
331    0.713657
332    0.922836
333    0.473598
Name: 0, Length: 334, dtype: object

In [42]:
type(newf[0])

pandas.core.series.Series

**Data Frame form through the combination of series**

In [43]:
newf2 = newf

In [44]:
# here newf2 is the view

newf2[0][0] = 9783

<ipython-input-44-8765462d7785>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newf2[0][0] = 9783

In [45]:
# even tho is update data in newf2 but also update it in the newf
# so newf2 is known as view

newf

            0         1         2         3         4
0        9783  0.143020  0.347843  0.680186  0.783925
1    0.080284  0.619411  0.637637  0.481598  0.149782
2    0.288158  0.780141  0.422168  0.604559  0.323094
3    0.821595  0.835345  0.714774  0.848404  0.046831
4    0.194477  0.447926  0.067030  0.888192  0.668843
..        ...       ...       ...       ...       ...
329  0.990653  0.565961  0.722428  0.009092  0.944413
330  0.969764  0.163666  0.908799  0.616855  0.244120
331  0.713657  0.123362  0.120819  0.199565  0.139388
332  0.922836  0.853739  0.845974  0.192337  0.743690
333  0.473598  0.786340  0.927190  0.829892  0.685971

[334 rows x 5 columns]

In [46]:
# if I want to copy it into the variable so we require
# newf[:] or newf.copy()

newf3 = newf.copy()

In [47]:
newf3[0][0] = 97834212

<ipython-input-47-bac04aeeda6f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newf3[0][0] = 97834212

In [48]:
newf

            0         1         2         3         4
0        9783  0.143020  0.347843  0.680186  0.783925
1    0.080284  0.619411  0.637637  0.481598  0.149782
2    0.288158  0.780141  0.422168  0.604559  0.323094
3    0.821595  0.835345  0.714774  0.848404  0.046831
4    0.194477  0.447926  0.067030  0.888192  0.668843
..        ...       ...       ...       ...       ...
329  0.990653  0.565961  0.722428  0.009092  0.944413
330  0.969764  0.163666  0.908799  0.616855  0.244120
331  0.713657  0.123362  0.120819  0.199565  0.139388
332  0.922836  0.853739  0.845974  0.192337  0.743690
333  0.473598  0.786340  0.927190  0.829892  0.685971

[334 rows x 5 columns]

In [49]:
newf3

            0         1         2         3         4
0    97834212  0.143020  0.347843  0.680186  0.783925
1    0.080284  0.619411  0.637637  0.481598  0.149782
2    0.288158  0.780141  0.422168  0.604559  0.323094
3    0.821595  0.835345  0.714774  0.848404  0.046831
4    0.194477  0.447926  0.067030  0.888192  0.668843
..        ...       ...       ...       ...       ...
329  0.990653  0.565961  0.722428  0.009092  0.944413
330  0.969764  0.163666  0.908799  0.616855  0.244120
331  0.713657  0.123362  0.120819  0.199565  0.139388
332  0.922836  0.853739  0.845974  0.192337  0.743690
333  0.473598  0.786340  0.927190  0.829892  0.685971

[334 rows x 5 columns]

**Set the Value in specific index**

When we directly set the value in specific index it's give us warning because it's think about this this is a copy

In [51]:
newf.loc[0,0] = 654

In [52]:
newf.head(2)

          0         1         2         3         4
0       654  0.143020  0.347843  0.680186  0.783925
1  0.080284  0.619411  0.637637  0.481598  0.149782

In [54]:
newf.columns = list("ABCDE")

In [56]:
newf.head(2)

          A         B         C         D         E
0       654  0.143020  0.347843  0.680186  0.783925
1  0.080284  0.619411  0.637637  0.481598  0.149782

In [57]:
newf[0,0]= 6445

In [58]:
newf.head(2)

          A         B         C         D         E  (0, 0)
0       654  0.143020  0.347843  0.680186  0.783925    6445
1  0.080284  0.619411  0.637637  0.481598  0.149782    6445

**You can see here we get a new column which is based on 0 col & 0 row because he didn't find a 0 column so that's why he made a new one column**

In [68]:
newf.loc[0,"A"]= 6445

In [69]:
newf.head(2)

,A,B,C,D,E,"(0, 0)","(0, A)","(A, 0)",0
0,6445,0.143020,0.347843,0.680186,0.783925,6445.0,6445.0,6445.0,NaN
1,0.080284,0.619411,0.637637,0.481598,0.149782,6445.0,6445.0,6445.0,NaN

# How to delete the column

In [77]:
newf = newf.drop(0,axis=1)
newf = newf.drop(('A',0),axis=1)
newf = newf.drop((0,0),axis=1)
newf = newf.drop('A',axis=0)
newf = newf.drop((0,'A'),axis=1)

In [80]:
newf.head(3)

          A         B         C         D         E
0      6445  0.143020  0.347843  0.680186  0.783925
1  0.080284  0.619411  0.637637  0.481598  0.149782
2  0.288158  0.780141  0.422168  0.604559  0.323094

In [82]:
# Set of column

newf.loc[[1,2], ["C","D"]]

          C         D
1  0.637637  0.481598
2  0.422168  0.604559

In [83]:
newf.head()

          A         B         C         D         E
0      6445  0.143020  0.347843  0.680186  0.783925
1  0.080284  0.619411  0.637637  0.481598  0.149782
2  0.288158  0.780141  0.422168  0.604559  0.323094
3  0.821595  0.835345  0.714774  0.848404  0.046831
4  0.194477  0.447926  0.067030  0.888192  0.668843

In [84]:
newf.loc[:, ["C","D"]]

            C         D
0    0.347843  0.680186
1    0.637637  0.481598
2    0.422168  0.604559
3    0.714774  0.848404
4    0.067030  0.888192
..        ...       ...
329  0.722428  0.009092
330  0.908799  0.616855
331  0.120819  0.199565
332  0.845974  0.192337
333  0.927190  0.829892

[334 rows x 2 columns]

In [85]:
newf.loc[[1,2], :]

          A         B         C         D         E
1  0.080284  0.619411  0.637637  0.481598  0.149782
2  0.288158  0.780141  0.422168  0.604559  0.323094

In [87]:
newf.loc[(newf["A"]<0.3)&(newf['C']>0.1)]

            A         B         C         D         E
1    0.080284  0.619411  0.637637  0.481598  0.149782
2    0.288158  0.780141  0.422168  0.604559  0.323094
6    0.266905  0.917742  0.578764  0.354202  0.668903
12   0.089613  0.552607  0.376306  0.543768  0.896149
13   0.266744  0.526198  0.292497  0.926605  0.479125
..        ...       ...       ...       ...       ...
314  0.066572  0.392321  0.874171  0.135895  0.759196
318   0.04175  0.121260  0.100540  0.696704  0.497025
323  0.140303  0.430697  0.909907  0.045261  0.164276
325  0.289202  0.087100  0.229957  0.699613  0.337702
327   0.16556  0.595945  0.117874  0.667574  0.839208

[90 rows x 5 columns]

**ILOC**

In [89]:
#if I want to count from index counting wise then we use iloc

newf.iloc[0,4]

0.7839254600724553

In [90]:
newf.iloc[[0,1],[1,2]]

          B         C
0  0.143020  0.347843
1  0.619411  0.637637

In [91]:
newf.head(3)

          A         B         C         D         E
0      6445  0.143020  0.347843  0.680186  0.783925
1  0.080284  0.619411  0.637637  0.481598  0.149782
2  0.288158  0.780141  0.422168  0.604559  0.323094

In [93]:
# inplace change it permanently

newf.drop([0],inplace=True)

In [96]:
newf.head(3)

          A         B         C         D         E
1  0.080284  0.619411  0.637637  0.481598  0.149782
2  0.288158  0.780141  0.422168  0.604559  0.323094
3  0.821595  0.835345  0.714774  0.848404  0.046831

In [98]:
# reset_index reset the data start from 0 to onward
# drop=true to remove the new index creation

newf.reset_index(drop=True,inplace=True)

In [99]:
newf.head(3)

          A         B         C         D         E
0  0.080284  0.619411  0.637637  0.481598  0.149782
1  0.288158  0.780141  0.422168  0.604559  0.323094
2  0.821595  0.835345  0.714774  0.848404  0.046831

In [102]:
# if the value is true is anywhere else than there is a null value

newf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
328    False
329    False
330    False
331    False
332    False
Name: B, Length: 333, dtype: bool

In [112]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                             pd.NaT]})

In [113]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [114]:
# it won't till every sort of data isn't gonna nan


df.dropna(how="all")

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [118]:
# Remove the duplicate of data

df.drop_duplicates(subset=['name'])

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [119]:
df.drop_duplicates(subset=['name'],keep="last")

     name        toy       born
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [120]:
df.drop_duplicates(subset=['name'],keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [121]:
df.shape

(3, 3)

In [123]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [127]:
df['toy'].value_counts(dropna=False)

NaN          1
Bullwhip     1
Batmobile    1
Name: toy, dtype: int64

In [128]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [134]:
newf.describe()

                B           C           D           E
count  333.000000  333.000000  333.000000  333.000000
mean     0.502659    0.518454    0.515079    0.506229
std      0.286199    0.293624    0.288169    0.287098
min      0.000561    0.003179    0.005991    0.000669
25%      0.255363    0.263356    0.269403    0.247864
50%      0.508426    0.554050    0.533395    0.523783
75%      0.733471    0.774383    0.747420    0.759142
max      0.997745    0.999220    0.991296    0.999934

In [133]:
newf.mean()

A    0.503659
B    0.502659
C    0.518454
D    0.515079
E    0.506229
dtype: float64

In [135]:
newf.corr()

          B         C         D         E
B  1.000000  0.064490  0.024647  0.047245
C  0.064490  1.000000 -0.016715 -0.009499
D  0.024647 -0.016715  1.000000 -0.021659
E  0.047245 -0.009499 -0.021659  1.000000

In [136]:
newf.count()

A    333
B    333
C    333
D    333
E    333
dtype: int64

In [137]:
newf.max()

A    0.996549
B    0.997745
C     0.99922
D    0.991296
E    0.999934
dtype: object

In [138]:
newf.min()

A    0.002164
B    0.000561
C    0.003179
D    0.005991
E    0.000669
dtype: object

In [139]:
newf.median()

A    0.540950
B    0.508426
C    0.554050
D    0.533395
E    0.523783
dtype: float64

In [140]:
newf.std()

A    0.282310
B    0.286199
C    0.293624
D    0.288169
E    0.287098
dtype: float64